// pages/information/information.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    plants:[
      {'item': '藿香', 'ACC': '95.8%'}, 
      {'item': '白芷', 'ACC': '94.3%'}, 
      {'item': '北柴胡', 'ACC': '98.5%'}, 
      {'item': '藜', 'ACC': '100.0%'}, 
      {'item': '凤眼蓝', 'ACC': '96.3%'}, 
      {'item': '栀子', 'ACC': '100.0%'}, 
      {'item': '仙鹤草', 'ACC': '100.0%'}, 
      {'item': '猴子草', 'ACC': '88.1%'}, 
      {'item': '鸭舌草', 'ACC': '100.0%'}, 
      {'item': '牵牛', 'ACC': '88.5%'}, 
      {'item': '玉竹', 'ACC': '92.3%'}, 
      {'item': '麦冬', 'ACC': '98.1%'}, 
      {'item': '半夏', 'ACC': '84.1%'}, 
      {'item': '溪黄草', 'ACC': '100.0%'}, 
      {'item': '板蓝根', 'ACC': '88.1%'}, 
      {'item': '蓝花参', 'ACC': '97.2%'}, 
      {'item': '苦艾', 'ACC': '100.0%'}, 
      {'item': '薄荷叶', 'ACC': '93.3%'}, 
      {'item': '阿拉伯婆婆纳', 'ACC': '89.1%'},
      {'item': '苍耳子', 'ACC': '90.5%'}, 
      {'item': '鸭跖草', 'ACC': '88.7%'}, 
      {'item': '蒲公英', 'ACC': '100.0%'},
      {'item': '灯笼草', 'ACC': '100.0%'},
      {'item': '飞蓬', 'ACC': '28.6%'}, 
      {'item': '人参', 'ACC': '97.5%'}, 
      {'item': '狗尾草', 'ACC': '78.4%'}, 
      {'item': '鬼针草', 'ACC': '100.0%'}, 
      {'item': '何首乌', 'ACC': '96.1%'}, 
      {'item': '金银花', 'ACC': '97.2%'}, 
      {'item': '红蓼', 'ACC': '93.5%'}, 
      {'item': '黄花菜', 'ACC': '85.7%'}, 
      {'item': '荠菜', 'ACC': '95.8%'}, 
      {'item': '卷耳', 'ACC': '100.0%'}, 
      {'item': '苦菜', 'ACC': '86.4%'}, 
      {'item': '白莲子', 'ACC': '91.7%'}, 
      {'item': '马兰', 'ACC': '100.0%'}, 
      {'item': '厚朴', 'ACC': '100.0%'},
      {'item': '曼陀罗', 'ACC': '87.8%'},
      {'item': '棕榈', 'ACC': '95.7%'}, 
      {'item': '紫苏', 'ACC': '100.0%'},
      {'item': '芭蕉', 'ACC': '86.5%'},
      {'item': '漆姑草', 'ACC': '91.0%'},
      {'item': '景天属', 'ACC': '91.5%'},
      {'item': '夏枯草', 'ACC': '95.1%'}, 
      {'item': '水芹', 'ACC': '96.0%'}, 
      {'item': '天胡荽', 'ACC': '100.0%'},
      {'item': '铜钱草', 'ACC': '98.3%'},
      {'item': '小蓟', 'ACC': '88.5%'}, 
      {'item': '小窃衣', 'ACC': '96.3%'}, 
      {'item': '荨麻', 'ACC': '87.5%'},
      {'item': '一串红', 'ACC': '92.3%'}, 
      {'item': '泽漆', 'ACC': '88.2%'}, 
      {'item': '酢浆草', 'ACC': '100.0%'}, 
      {'item': '紫云英', 'ACC': '75.0%'}
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})